# Bonus: Temperature Analysis I

In [ ]:
from

In [103]:
import pandas as pd
from datetime import datetime as dt

In [104]:
# "tobs" is "temperature observations"
df = pd.read_csv('./Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [92]:
# Convert the date column format from string to datetime
#date_time_obj = dt.strptime(str(df['date']), '%yyyy/%mm/%dd')
df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
date_time = df['date'] 
date_time

0       2010-01-01
1       2010-01-02
2       2010-01-03
3       2010-01-04
4       2010-01-06
           ...
19545   2017-08-19
19546   2017-08-20
19547   2017-08-21
19548   2017-08-22
19549   2017-08-23
Name: date, Length: 19550, dtype: datetime64[ns]

In [64]:
# Set the date column as the DataFrame index
date_index = df.set_index("date")
date_index

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73
...                 ...   ...   ...
2017-08-19  USC00516128  0.09    71
2017-08-20  USC00516128   NaN    78
2017-08-21  USC00516128  0.56    76
2017-08-22  USC00516128  0.50    76
2017-08-23  USC00516128  0.45    76

[19550 rows x 3 columns]

In [69]:
# Drop the date column
drop_date = df.drop(['date'], axis=1)
drop_date

           station  prcp  tobs
0      USC00519397  0.08    65
1      USC00519397  0.00    63
2      USC00519397  0.00    74
3      USC00519397  0.00    76
4      USC00519397   NaN    73
...            ...   ...   ...
19545  USC00516128  0.09    71
19546  USC00516128   NaN    78
19547  USC00516128  0.56    76
19548  USC00516128  0.50    76
19549  USC00516128  0.45    76

[19550 rows x 3 columns]

In [94]:
df['date'].dt.to_period('m')

0        2010-01
1        2010-01
2        2010-01
3        2010-01
4        2010-01
          ...
19545    2017-08
19546    2017-08
19547    2017-08
19548    2017-08
19549    2017-08
Name: date, Length: 19550, dtype: period[M]

In [100]:
df['date'].dt.strftime('%y/%m')

0        10/01
1        10/01
2        10/01
3        10/01
4        10/01
         ...
19545    17/08
19546    17/08
19547    17/08
19548    17/08
19549    17/08
Name: date, Length: 19550, dtype: object

In [105]:
df['mm']= pd.to_datetime(df['date']).dt.month
df['mm']

0        1
1        1
2        1
3        1
4        1
        ..
19545    8
19546    8
19547    8
19548    8
19549    8
Name: mm, Length: 19550, dtype: int64

In [106]:
df

           station        date  prcp  tobs  mm
0      USC00519397  2010-01-01  0.08    65   1
1      USC00519397  2010-01-02  0.00    63   1
2      USC00519397  2010-01-03  0.00    74   1
3      USC00519397  2010-01-04  0.00    76   1
4      USC00519397  2010-01-06   NaN    73   1
...            ...         ...   ...   ...  ..
19545  USC00516128  2017-08-19  0.09    71   8
19546  USC00516128  2017-08-20   NaN    78   8
19547  USC00516128  2017-08-21  0.56    76   8
19548  USC00516128  2017-08-22  0.50    76   8
19549  USC00516128  2017-08-23  0.45    76   8

[19550 rows x 5 columns]

### Compare June and December data across all years

In [58]:
from scipy import stats

In [149]:
# Filter data for desired months
desired_month_june = df.loc[df["mm"]==8]
desired_month_june.head()

         station        date  prcp  tobs  mm
190  USC00519397  2010-08-01  0.04    77   8
191  USC00519397  2010-08-02  0.01    76   8
192  USC00519397  2010-08-03  0.02    77   8
193  USC00519397  2010-08-04  0.07    77   8
194  USC00519397  2010-08-05  0.08    75   8

In [115]:
# Identify the average temperature for June
avg_june = desired_month_june['tobs'].mean()
avg_june indi

76.41245376078915

In [148]:
# Filter data for desired months
desired_month_december = df.loc[df["mm"]==12]
desired_month_december.head()

         station        date  prcp  tobs  mm
305  USC00519397  2010-12-01  0.04    76  12
306  USC00519397  2010-12-03  0.00    74  12
307  USC00519397  2010-12-04  0.00    74  12
308  USC00519397  2010-12-06  0.00    64  12
309  USC00519397  2010-12-07  0.00    64  12

In [150]:
# Identify the average temperature for December
avg_december = desired_month_december['tobs'].mean()
avg_december

71.04152933421226

Paired t-test is used to determine the difference between the average temperature in June and December because the two samples compared are related to the same group of sample for a particular location. Using the average temperature for different time of the year in the same location.

Null-Hypothesis (H0): The difference between average temperature in June and December is not statistically significant.

In [123]:
# Run paired t-test
stats.ttest_ind(desired_month_june['tobs'], desired_month_december['tobs'])

Ttest_indResult(statistic=41.798247698370034, pvalue=6.338684512759386e-304)

### Analysis

The calculated p-value of 6.34e-304, is a lot less than the significant level alpha (that is,0.005). This implies that there is a statistical significant difference between the temperature in June and December. So we reject the Null hypothesis.